IDEA StatiCa Open Model
Settlement.Support Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Support with settlement
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement Support { get; set; }
Public Property Support As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Support {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Settlement Class
IdeaRS.OpenModel.Loading Namespace